import scss from "./pitures.module.scss";
import React from "react";
import image1 from "../../public/images/1300x400.png";
import image2 from "../../public/images/800x400.png";
import image3 from "../../public/images/400x600.png";
import Image from "next/image";

const Pictures = () => {
  return (
    <div className={scss.wrapper}>
      <div className="container">
        <div className={scss.cards__main}>
          <div className={scss.card__example}>
            <h3>Заголовок</h3>
            <div className={scss.image__main}>
              <Image src={image1} alt="image" />
            </div>
            <p>
              Далеко-далеко, за словесными горами в стране гласных и согласных
              живут рыбные тексты. Залетают жизни если агентство! Букв наш
              рекламных, запятой всеми до ее на берегу если первую даль города
              сбить свой ipsum власти образ от всех свое но сих предупреждал
              предложения, рукописи залетают. Послушавшись, единственное
              подпоясал свое точках своих его назад силуэт безорфографичный
              снова.
            </p>
          </div>
          <div className={scss.card__example}>
            <h3>Заголовок</h3>
            <div className={scss.image__main}>
              <Image src={image2} alt="image" />
            </div>
            <p>
              Далеко-далеко, за словесными горами в стране гласных и согласных
              живут рыбные тексты. Залетают жизни если агентство! Букв наш
              рекламных, запятой всеми до ее на берегу если первую даль города
              сбить свой ipsum власти образ от всех свое но сих предупреждал
              предложения, рукописи залетают. Послушавшись, единственное
              подпоясал свое точках своих его назад силуэт безорфографичный
              снова.
            </p>
          </div>
        </div>
        <div className={scss.cards__main__second}>
          <div className={scss.card__example}>
            <h3>Заголовок</h3>
            <div className={scss.image__main__second}>
              <Image src={image2} alt="image" />
            </div>
            <p>
              Далеко-далеко, за словесными горами в стране гласных и согласных
              живут рыбные тексты. Залетают жизни если агентство! Букв наш
              рекламных, запятой всеми до ее на берегу если первую даль города
              сбить свой ipsum власти образ от всех свое но сих предупреждал
              предложения, рукописи залетают. Послушавшись, единственное
              подпоясал свое точках своих его назад силуэт безорфографичный
              снова.
            </p>
          </div>
          <div className={scss.card__example}>
            <h3>Заголовок</h3>
            <div className={scss.image__main__second}>
              <Image src={image3} alt="image" />
            </div>
            <p>
              Далеко-далеко, за словесными горами в стране гласных и согласных
              живут рыбные тексты. Залетают жизни если агентство! Букв наш
              рекламных, запятой всеми до ее на берегу если первую даль города
              сбить свой ipsum власти образ от всех свое но сих предупреждал
              предложения, рукописи залетают. Послушавшись, единственное
              подпоясал свое точках своих его назад силуэт безорфографичный
              снова.
            </p>
          </div>
          <div className={scss.card__example}>
            <h3>Заголовок</h3>
            <div className={scss.image__main__second}>
              <Image src={image1} alt="image" />
            </div>
            <p>
              Далеко-далеко, за словесными горами в стране гласных и согласных
              живут рыбные тексты. Залетают жизни если агентство! Букв наш
              рекламных, запятой всеми до ее на берегу если первую даль города
              сбить свой ipsum власти образ от всех свое но сих предупреждал
              предложения, рукописи залетают. Послушавшись, единственное
              подпоясал свое точках своих его назад силуэт безорфографичный
              снова.
            </p>
          </div>
        </div>
        <div className={scss.cards__main__third}>
          <div className={scss.card__example}>
            <div className={scss.image__main__third}>
              <Image src={image1} alt="image" />
            </div>
            <div className={scss.right__content}>
              <h3>Заголовок</h3>
              <p>
                Далеко-далеко, за словесными горами в стране гласных и согласных
                живут рыбные тексты. Залетают жизни если агентство! Букв наш
                рекламных, запятой всеми до ее на берегу если первую даль города
                сбить свой ipsum власти образ от всех свое но сих предупреждал
                предложения, рукописи залетают. Послушавшись, единственное
                подпоясал свое точках своих его назад силуэт безорфографичный
                снова.
              </p>
            </div>
          </div>
          <div className={scss.card__example}>
            <div className={scss.image__main__third}>
              <Image src={image3} alt="image" />
            </div>
            <div className={scss.right__content}>
              <h3>Заголовок</h3>
              <p>
                Далеко-далеко, за словесными горами в стране гласных и согласных
                живут рыбные тексты. Залетают жизни если агентство! Букв наш
                рекламных, запятой всеми до ее на берегу если первую даль города
                сбить свой ipsum власти образ от всех свое но сих предупреждал
                предложения, рукописи залетают. Послушавшись, единственное
                подпоясал свое точках своих его назад силуэт безорфографичный
                снова.
              </p>
            </div>
          </div>
          <div className={scss.card__example}>
            <div className={scss.image__main__third}>
              <Image src={image2} alt="image" />
            </div>
            <div className={scss.right__content}>
              <h3>Заголовок</h3>
              <p>
                Далеко-далеко, за словесными горами в стране гласных и согласных
                живут рыбные тексты. Залетают жизни если агентство! Букв наш
                рекламных, запятой всеми до ее на берегу если первую даль города
                сбить свой ipsum власти образ от всех свое но сих предупреждал
                предложения, рукописи залетают. Послушавшись, единственное
                подпоясал свое точках своих его назад силуэт безорфографичный
                снова.
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Pictures;
